using Hedgehog.Models;
using System.Diagnostics;

public class Program
{
    public static void Main()
    {
        while (true)
        {
            Console.Clear();

            try
            {

                GC.Collect();
                GC.WaitForPendingFinalizers();
                GC.Collect();
                var input = new HedgehogInput();
                input.ReadInput();


                //long memBefore = GC.GetTotalMemory(true);
                var stopwatch = new Stopwatch();
                stopwatch.Start();
                if (input.Population == null) { throw new Exception("Популяція відсутня"); }
                var forest = new Forest(input.Population, input.TargetColor);
                int result = forest.MinMeetingsToUnify();

                stopwatch.Stop();
                long memAfter = GC.GetTotalMemory(true);

                Console.WriteLine($"\nМiнiмальна кiлькiсть зустрiчей: {result}");
                Console.WriteLine($"Час виконання: {stopwatch.Elapsed.TotalMilliseconds.ToString()} мс");
                Console.WriteLine($"Видiлено пам'ятi: {Math.Abs(memAfter)} байт");
            }
            catch (Exception ex)
            {
                Console.WriteLine($"\nПомилка: {ex.Message}");
            }

            Console.WriteLine("\nНатиснiть Enter для наступного запуску...");
            Console.ReadLine();
        }
    }
}
/*
 ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⠀⣰⡄⠀⢠⡀⠀⣾⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣶⣄⣿⠦⡜⢻⣴⠃⢸⢦⠋⢣⣼⣿⡠⠖⣿⠀⣀⢤⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣷⣄⣻⠦⣿⣄⠁⠀⢱⠈⡇⠀⢸⠀⠀⠈⢻⠋⠁⠀⡟⠉⠀⠰⠗⢙⠇⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠤⣀⢹⠙⠛⢦⡀⠈⢢⡀⠈⠆⠈⠀⠘⠀⠀⠀⠘⠀⠀⠀⠇⠀⠀⠀⠀⠈⠉⢩⣏⡀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠲⡦⠽⠇⠀⠀⣀⡀⠀⠉⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠔⠋⠽⠥⣤⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠤⠽⠦⠀⢠⠋⠁⠈⢢⡀⠀⠀⣤⣼⣄⢠⢧⣰⣧⡀⣠⣦⣤⡴⠋⠉⠙⢅⠀⠀⠀⢰⣁⡤⠆⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⣠⣶⡾⠶⣄⡀⠀⢸⠀⠀⠀⠀⡗⢾⠶⠏⠋⠈⠏⠈⠋⠉⠛⠁⠟⠿⠀⠀⠀⠀⣼⠀⠐⠚⣉⣥⠟⠂⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠉⢁⡶⠞⠁⠀⠈⢣⣀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣴⡁⠀⠀⠀⠀⠈⠉⣲⠄⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⣾⣅⠀⠀⠀⠀⠈⣫⣹⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⡇⡿⣥⣤⠄⠀⠒⠒⠉⠻⣗⠂⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠺⢯⣭⠉⠁⠀⠀⠀⠈⣇⢹⠀⢀⣴⣶⣄⠀⠀⠀⠀⠀⠀⠀⠀⣴⣶⣤⡀⢸⠁⠻⣥⡀⠀⠀⠀⠀⠀⠀⣄⣙⣦⣀⠀
⠀⠀⠀⠀⠀⠰⢞⣉⠀⠀⠀⠀⠀⠘⢯⡍⠈⡆⢸⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣿⠇⢸⠀⠀⢻⣷⠄⠀⠀⠀⠀⠀⠀⣹⣤⠀⠀
⠀⠀⠀⠀⠀⣠⣔⣋⣀⡀⠀⠀⠀⣴⠏⠀⠀⠹⡀⠀⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠉⠁⠀⢀⠇⠀⠀⠀⣼⡗⠀⠀⠀⠈⠉⠑⠛⢧⡀⠀
⠀⠀⢀⡤⠚⡹⠋⠀⠀⠀⠀⢀⣴⣁⡀⠀⠀⠀⠙⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠎⠀⠀⠀⠀⠀⣽⠂⠀⠀⠀⠀⠀⢠⣤⣹⡦
⠀⠀⠁⠐⠮⠤⣤⡀⠀⠀⠀⠀⢩⠋⠈⠳⡀⠀⠀⠈⠢⡀⠀⢠⣴⣶⣶⣶⡄⠀⢀⡴⠋⠀⠀⠀⠀⡴⢯⡬⠷⠀⠀⠀⠀⠀⠀⠙⡄⠀
⠀⠀⠀⠀⣠⣴⡿⠃⠀⠀⠀⠰⢷⡶⠀⠀⢱⠀⠀⠀⠀⠘⠢⣈⠻⢿⡿⠛⣁⠴⠋⠀⠀⠀⠀⠀⡜⠀⠀⢻⡶⠀⠀⠀⠀⠀⠢⣀⣘⡄
⠀⢀⠴⠊⣡⠋⡀⠀⠀⠀⠀⢠⠏⡀⠀⠀⠀⣇⠀⠀⠀⠀⠀⠀⠉⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀⣰⠁⠀⠀⣷⡷⡄⠐⠒⠒⠀⠀⠙⢧⡁
⠖⠁⠀⣴⣷⡾⠃⠀⠀⠀⠀⠋⣹⣃⠀⠀⠀⠘⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠃⠀⠀⠀⢻⡇⠀⠀⠀⠀⠲⢤⣀⠀⢻
⣠⠖⠉⠀⠘⡷⠃⠀⠀⠀⠀⠐⠛⡿⣄⠀⠀⠀⠈⠣⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠔⠁⠀⠀⠀⣰⣿⠛⠃⠀⠀⠀⠀⠀⠙⡍⠐
⠁⠀⠀⢀⣞⣁⣀⡀⠀⠀⠀⢀⠰⠛⡏⠳⣄⠀⠀⠀⠈⠳⡄⠀⠀⠀⠀⠀⠀⠀⢠⠎⠁⠀⠀⠀⣠⠞⡙⣟⠂⠀⠀⠀⠀⠰⢤⣄⣸⡄
⠀⠀⠀⢈⡩⡿⠋⡀⢀⡴⠊⠁⠀⠐⢿⣦⠤⠷⠦⢤⣤⠞⠁⠀⠀⠀⠀⠀⠀⠀⠈⢳⣤⠤⠴⠿⠤⣄⡏⠉⠀⠀⠈⠓⠦⣀⠀⠿⠮⡁
⠀⠀⠴⠋⠀⠛⣽⣡⠊⠀⠀⠀⠀⠀⠈⢻⣧⡀⠀⠀⠀⠹⣄⠀⠀⠀⠀⠀⠀⠀⡞⠉⠀⠀⠀⠀⢠⡿⠁⠀⢤⡀⠀⠀⢦⡹⡏⠛⠀⠉
⠀⠀⠀⠀⠀⠀⠓⠻⠇⠀⢀⡴⠀⠀⠀⠀⠹⠗⢷⠀⠀⢠⠿⡷⢦⣶⡴⣿⣷⢷⣇⠀⠀⠀⣄⡞⠛⠀⠀⡀⠀⠈⢦⠀⠸⡿⣧⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠘⠒⡶⠃⣀⠀⠀⠀⢀⠀⠀⠈⠓⠒⠋⠀⠀⠈⠀⠀⠀⠀⠀⠈⠓⠒⠒⠃⠀⡀⠀⠀⠱⡄⠀⠈⡗⠤⠇⠈⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⢰⡧⠚⢻⠀⣠⣴⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠑⣄⢀⡀⢸⢦⣤⡇⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠘⠉⠀⢻⠞⣆⡴⢦⠀⣴⣄⣀⢀⣦⣰⣄⢠⡄⢀⢤⣀⡿⣤⠴⠴⠒⠼⣏⠉⠃⠀⠁⠀⠀⠀⠀⠀⠀⠀
⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣯⣤⣼⣿⣶⣿⣾⣿⣼⣷⣾⣷⣼⣿⣤⣿⣦⣬⣤⣤⣤⣤⣼⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤
⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
 */
